// #include <iostream> // 헤더파일 => 무조건 쓰기
// int main() { -> int는 출력, 출력이 없는 경우는 void

/* 1. 변수선언
// num이라는 변수에 10을 저장하자.
int num;	// 변수 선언을 먼저하고
num = 10;	// 변수에 값을 대입한다.(대입연산자 : 오른쪽에 있는걸 왼쪽에 집어 넣음)
*/

/* 2. 함수정의
void func() {	// 함수이름은 func이고
				// 입력은 없고 출력은 없다.

}

void func1(int a) { // 함수이름은 func1이고
					// 입력은 int a이고 출력없다.

}

int func2() {		// 함수이름은 func2이고
					// 입력은 없고, 출력은 int이다.
  return int(정수);	// 출력이 있을때는 꼭 리턴
}
*/

/* 3. 함수호출
* func();	// 함수머리에서 출력을 생략한다.
* func1();	//
* func2();	//
*/

// 변수 = 저장할 수 있는 공간
// 상수 = 저장할 수 있는 공간(고정)
// 변수선언 -> 램으로부터 저장할 수 있는 공간을 할당받음
// 함수와 변수 차이 => 괄호
// 함수 사용 시, 함수 선언하고 호출